Revit 2026 API

# SchemaCommonBaseSchema Property

---

The property labeled "BaseSchema" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string BaseSchema { get; }
```
```vb
Public Shared ReadOnly Property BaseSchema As String
	Get
```
```cpp
public:
static property String^ BaseSchema {
	String^ get ();
}
```
```fsharp
static member BaseSchema : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace